# SelectionSemitransparent Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
ColorOptions..::..SelectionSemitransparent Property
ColorOptions Class See Also
---
Indicates whether or not selections will be shown in a semi-transparent manner.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public bool SelectionSemitransparent { get; set; }
```

Visual Basic
---
```text
Public Property SelectionSemitransparent As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool SelectionSemitransparent {
	bool get ();
	void set (bool value);
}
```

# See Also
ColorOptions Class
Autodesk.Revit.DB Namespace